app/Http/Livewire/Destination.php

select * from `destinations` where `slug` = 'bromo-mountain' limit 1
select * from `reviews` where `destination_id` = 1
select sum(`rating`) as aggregate from `reviews` where `destination_id` = 1
select exists(select * from `categories` where `slug` = 'mountain') as `exists`
select exists(select * from `destinations` where `slug` = 'bromo-mountain' limit 1) as `exists`
select * from `categories` where `categories`.`id` in (1)
---
    public function render()
    {
        $find_category = Category::where('slug', $this->category_slug);
        $find_destination = ModelsDestination::where('slug', $this->destination_slug);

        $ratings = Review::where('destination_id', $find_destination->first()->id)->get();
        $rating_sum = Review::where('destination_id', $find_destination->first()->id)->sum('rating');
        // $user_review = Review::latest()->where('destination_id', $find_destination->id)->get();
        // $review = Review::where('user_id', Auth::id())->where('destination_id', $find_destination->id)->first();

        if ($ratings->count() > 0) {
            $rating_value = $rating_sum / $ratings->count();
        } else {
            $rating_value = 0.0;
        }


        if($find_category->exists()) {
            if($find_destination->exists()) {
                $destination = ModelsDestination::where('slug', $this->destination_slug)->with('category')->first();
                $others = ModelsDestination::getOtherDestinationReview($find_destination->first());