app/Http/Livewire/Destinations.php

select * from `categories`
select count(*) as aggregate from `destinations` where `status` = 1
---
    public function render()
    {
        $getDestinationActive = Destination::where('status', 1);

        // $destinations = $getDestinationActive->latest()->filter(request(['search', 'category']))->with('category')->paginate(12);
        $destinations = Destination::getDestinationsReviewWithPaginate(request('category'), request('search'), $this->perPage);
        $categories = Category::all();

        $isAllLoaded = ($this->perPage > $getDestinationActive->count() || $getDestinationActive->count() <= 12) ?? true;