app/Http/Controllers/AdminFrontendController.php

select * from `destinations`
select count(*) as aggregate from `orders` where `created_at` >= '2022-06-29 00:00:00'
select * from `orders` where `created_at` >= '2022-06-06 00:00:00'
---
    public function dashboardView()
    {
        $get_week = \Carbon\Carbon::today()->subDays(7);
        $get_month = \Carbon\Carbon::today()->subDays(30);

        $title = 'Dashboard';
        $latest_orders = Order::latest()->with('destination')->limit(2)->get();
        $orders_count = Order::where('created_at', '>=', $get_week)->count();
        $income_orders = Order::where('created_at', '>=', $get_month)->get();

select * from `categories`
---
    public function destinationsView()
    {
        $destinations = Destination::getDestinationsReview();

        $categories = Category::all();

select * from `categories` order by `created_at` desc
select * from `destinations` where `destinations`.`category_id` in (1, 2, 3, 4, 5, 6, 7, 8)
---
    public function categoriesView()
    {
        $categories = Category::latest()->with('destinations')->get();