app/Http/Controllers/AuthController.php

    public function store(RegisterRequest $request)
    {
        $email = $request->email;

        $user = new User([
            "name" => $request->name,
            "email" => $email,
            "password" => $request->password,
        ]);

        $user['password'] = bcrypt($user['password']);
        $user->save();
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Admin2', 'admin2travelend@gmail.com', '$2y$10$VTbB9GUdO9dB9M15rEJorOLqzPVJ23GulwDLEqDC6lP5YAlo2UEfu', '2022-07-06 02:54:42', '2022-07-06 02:54:42')